# Electrical System Wire Type Property

Source: https://www.revitapidocs.com/2026/d605965d-bbed-c3c9-14fa-2d040ec76dca.htm

---

| Electrical System Wire Type Property |
| --- |

**Note: This API is now obsolete.**

The wire type of the Electrical System.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
[ObsoleteAttribute("This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use CableType instead. CableType will be set on ElectricalSystem properly during document upgrade.")]
public WireType WireType { get; set; }
```

```
<ObsoleteAttribute("This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use CableType instead. CableType will be set on ElectricalSystem properly during document upgrade.")>
Public Property WireType As WireType
	Get
	Set
```

```
public:
[ObsoleteAttribute(L"This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use CableType instead. CableType will be set on ElectricalSystem properly during document upgrade.")]
property WireType^ WireType {
	WireType^ get ();
	void set (WireType^ value);
}
```

```
[<ObsoleteAttribute("This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use CableType instead. CableType will be set on ElectricalSystem properly during document upgrade.")>]
member WireType : WireType with get, set
```

#### Property Value

WireType Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non\-optional argument was null |

Remarks This property is used to retrieve the wire type of the Electrical System. See Also

#### Reference

ElectricalSystem Class Autodesk.Revit.DB.Electrical Namespace